//将相同list的两道题的答案按条件合并到一个题里，1对应1， 2和3对应2,4对应3,5和6对应4......
ClearForm(f('quotaOC'));
if(f('mainOC1') == '1' || f('mainOC2') == '1') {
  f('quotaOC')['1'].set('1');
}

var arr = [['1'], ['2', '3'], ['4'],['5', '6'], ['7'], ['8', '9'], ['13'], ['14', '15'], ['16'], ['17', '18'],
       ['19'], ['20', '21'], ['22'], ['23', '24'], ['26', '27'], ['37'], ['40'], ['58'], ['31'], ['35', '36'], ['47', '48'], ['53', '54']];

for(var i = 0; i < arr.length; i++) {
  for(var j = 0; j < arr[i].length; j++) {
    if(f('mainOC1') == arr[i][j] || f('mainOC2') == arr[i][j]) {
      f('quotaOC')[i+1].set('1');
    }
  }
}
